---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LinkFailures.CannotPublishSharedCoordinatesToMirroredNonRevitLinks
source: html/7fe8291b-b467-ed4c-b4a8-2f767377fd0a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LinkFailures.CannotPublishSharedCoordinatesToMirroredNonRevitLinks Property

Shared coordinates cannot be published to mirrored, non Revit, links.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPublishSharedCoordinatesToMirroredNonRevitLinks { get; }
```